[
    { "id": -2, "title": "presentiment prototype", "date": "", "skills": [], "subtitle": "is now live on itch", "size": "small", "image": "images/presentiment__screenshot.png", "color": [0, 0, 0], "textColor": "gray", "link": "https://cannedcorgies.itch.io/presentiment-prototype", "text": ""},
    { "id": -1, "title": "watch my speech", "date": "", "skills": [], "subtitle": "one year since blast off", "size": "small", "image": "images/mySpeech.png", "color": [0, 0, 0], "textColor": "white", "link": "https://youtu.be/7Fi74QpvWso?si=uR1DOs-RFr2QzC-T&t=597", "text": ""},
    { "id": 0, "title": "UCLA cs spotlight", "date": "", "skills": [], "subtitle": "follow my journey", "size": "small", "image": "images/mySpotlight.png", "color": [0, 0, 0], "textColor": "gray", "link": "https://csforca.org/cs-spotlight-fern-alcazar/", "text": ""},
    { "id":1, "title": "author's note", "skills": ["rapid prototyper", "storyteller", "educator", "technical artist", "3D artist", "level designer", "physics programmer", "sound designer", "engine lead"], "date": "", "subtitle": "", "size": "large", "image": "images/heart.gif", "color": [95, 174, 246], "textColor": "white", "link": "https://cannedcorgies.itch.io", "video": "", "text": "Hello. My name is fern. An ambitious game designer and a lifelong Nintendo nerd. I make prototypes for small ideas that i think are cool.\n\nOver time, i became obsessed with kinaesthetics in games: how dextrous and meaningfully tactile input provides an enriching yet emotionally intelligent narrative experience. Touch is our main grammar for engaging with the environment, and I’m always excited to see the emerging ways in which brilliant new developers put our senses in dialogue with reflections of the world around us. From picking at bugs to tossing helicopter seeds, blowing dandelions and putting pots out in the rain; there is an untapped treasure trove of game ideas which fully surrounds us, and I’m anxious for us as a collective to discover that fact. Although i’ve yet a long journey ahead, my mission is to introduce a new standard of physicality and agency in games—one which thrives on gameplay reciprocation.\n\nHere in this time capsule, i enclose the unadulterated reflections of my projects across my journey so far—from the very first to the very last thing you’ve got to know about me—a showcase of my growth and my unedited reactions to it. I encourage you to cheer fern on as you watch him grow." },
    { "id":2, "title": "Flick", "date": "2023", "skills": ["unity", "prototyper"],"subtitle": "Gotta start somewhere!", "size": "small", "image": "images/Prototype__Flick.gif", "color": [150, 150, 150], "textColor": "black", "link": "https://cannedcorgies.itch.io/mechanic-prototype-flick", "video": "", "text": "Fern's Unity Breakthrough! Master a challenging, debatably \"fair\" obstacle course as a puny bottle cap.\n\n" },
    { "id":3, "title": "Kirby's Dream Course Warm-Up", "date": "2023", "skills": ["unity", "prototyper"], "subtitle": "[No affiliation with Nintendo]", "size": "small", "image": "images/Prototype__Kirby'sDreamCourse.gif", "color": [150, 150, 150], "textColor": "black", "link": "https://cannedcorgies.itch.io/kirbys-dream-course-warm-up", "video": "", "text": "Launch your toys into one another in a demo inspired by cult classic, Kirby's Dream Course!\n\nMy first venture into Unity’s interface, and I started with a declaration – a mission statement of sorts: your games will not be games. I’m looking to propel beyond the quantitative expectations of modern play. Beyond scores, progression metrics, beyond levels and percentages, I’m looking for provocative ways of interacting: what I called storied texture.\n\nThe way in which we feel the freedom of the soaring sand dunes in Journey, the way in which we feel our Sisyphus moment climbing up in Celeste, the way we toast to longevity with cans of peaches in What Remains of Edith Finch, all are incredibly physical, often tactile ways of conversing with play.\n\nWhat a start: a game with impeded movement and a demo about banging your toys together. I am already proud to see my progression going forward.\n\nFinally, to quote It Takes Two’s Josef Fares: “No Shiny Shit!”" },
    { "id":4, "title": "Slowdown", "date": "2023", "skills": ["unity", "prototyper"], "subtitle": "Take charge of time.", "size": "small", "image": "images/Prototype__TimeDilation.gif", "color": [207, 226, 243], "textColor": "black", "link": "https://cannedcorgies.itch.io/slowdown", "video": "", "text": "An unassuming simulation/sidescroller about slowing down time – until you realize that not everything follows the rules of time. Observe the simulation of the custom segmented timescale or experiment across an obstacle course demo which stretches the flow of time to the limit!\n\nFrom curiosity-driven simulation to time-bending platforming concept, this prototype marks my first act of defiance against Unity. Walking through the woods at my campus one sprinkling morning, I became mesmerized by the free falling nature of droplets as they floated down from tree branches to dirt. The rain fell in slow motion, yet, I moved normally as though suspended in time.\n\nWhen I got in front of the computer to replicate this nature, I was faced with uncompromising Unity physics: either everything slows down or nothing does at all. I’m not one to be told there is no in-between, so I made my own timescale. In my custom system, all objects to be slowed down essentially pass through a “conduit,” where their physics are updated via a static script during slowdown, then, mathematically restored to normal speed on return." },
    { "id":5, "title": "Pixel Rain", "date": "2023", "skills": ["unity", "prototyper", "technical artist"],"subtitle": "[bahhhhh]", "size": "small", "image": "images/sheep.gif", "color": [150, 150, 150], "textColor": "black", "link": "https://cannedcorgies.itch.io/pixel-rain", "video": "", "text": "Trod around an island and take in a rainy moment./n/nI’ve been told that a game will not be enjoyable unless the greyboxing is fun. As a challenge, I wanted to see how much of a game’s feel can actually ride on its aesthetic, and, unassumingly, this game lives off aesthetic. Strip the rain particles, the trees’ bounciness, sound design, pixelated filters and rolling clouds, and you get a clunky grey walking simulator." },
    { "id":6, "title": "DRILLDRILLDRILL", "date": "2023", "skills": ["javaScript", "phaser.js"], "subtitle": "How far can you go?", "size": "small", "image": "images/Prototype__DrillDrillDrill.gif", "color": [150, 150, 150], "textColor": "black", "link": "https://cannedcorgies.itch.io/drilldrilldrill", "video": "", "text": "Stay afloat as a speedy drill in sandy skies./n/nDRILLDRILLDRILL, came from observing a certain species of bird which uses momentum to dive in and out of trees. This game marks my first attempt at fully custom and expressive physics, and to great fruition: chaotic, but responsive." },
    { "id":7, "title": "Ripple", "date": "2023", "skills": ["javaSscript", "phaser.js"], "subtitle": "One button to rule them all!", "size": "small", "image": "images/Ripple.gif", "color": [150, 150, 150], "textColor": "white", "link": "https://cannedcorgies.itch.io/ripple", "video": "", "text": "Challenge a friend to a one button rhythm game./n/nRipple came from the evil thought of creating a competitive game where players must share the controller. Emergent behaviour galore: players pushing each other, deliberately pressing the button out of turn, or even creating their own rules such as “hands behind your back”." },
    { "id":8, "title": "Grow", "date": "2023", "skills": ["unreal engine", "grow programmer"],"subtitle": "Nothing lasts forever.", "size": "small", "image": "images/Grow.gif", "color": [49, 231, 149], "textColor": "black", "link": "https://cannedcorgies.itch.io/mechanic-prototype-grow", "video": "", "text": "An experimental walking simulator that invokes the interplay of admiration for nature and human presence. Take a walk through a generative landscape and invite yourself to watch the flowers grow. Stick around longer and you’ll get the chance to say goodbye, as well.\n\nMy first dive into team-driven prototyping. Given tight deadlines, we sought to make use of minimalism to capitalize on a message. Still brushing off the residue from my “Slowdown” prototype, I pitched the idea of creating conversation between human and environment with the passage of time as the central platform.\n\nWe chose to introduce a chaotic element directly out of the player’s control. To this end, we “wrapped” the player in a time bubble, in which plants within the vicinity grow much faster. This creates a tragic gameplay loop where a player wishes to observe the flowers closely, but they may acknowledge that prolonged observation speed up a plant’s death.\n\nGiven previous experience, I served as the lead programmer for the project. No special time-conduit involved; however, flower growth rate is impacted by player proximity with some nuanced lerping for a more natural look." },
    { "id":9, "title": "Stick Together", "date": "2023", "skills": ["unity", "prototyper"], "subtitle": "Two's a crowd...", "size": "small", "image": "images/Prototype__StickTogether.gif", "color": [150, 150, 150], "textColor": "black", "link": "https://cannedcorgies.itch.io/game-prototype-stick-together", "video": "", "text": "Enter co-op in a body-sharing puzzle platformer!\n\nfirst, I channeled some leftover inspiration from the button-sharing, but instead thought: what if the players shared one body? With jelly-like behavior and level geometry of varying sizes, I created a short puzzle platformer that is sure to get partners made at each other." },
    { "id":10, "title": "To the Top", "date": "2023", "skills": ["unity", "prototyper"], "subtitle": "nyyyOOooommmmm...", "size": "small", "image": "images/Prototype__Teleporting.gif", "color": [150, 150, 150], "textColor": "black", "link": "https://cannedcorgies.itch.io/mechanic-prototype-to-the-top", "video": "", "text": "Warp through the skies in a teleporting ballad!\n\nThe teleporting mechanic came from a yearning for expression. My favorite physics-based movement schemes are those which are superficially simple but with a high mechanical ceiling; think Super Mario or Neon White. A lot of tweaking went into the variables to allow for surprises without taking away control." },
    { "id":11, "title": "Soundwaves", "date": "2023", "skills": ["unity", "prototyper"], "subtitle": "Jump on the dance floor!", "size": "small", "image": "images/Prototype__Soundwaves.gif", "color": [150, 150, 150], "textColor": "white", "link": "https://cannedcorgies.itch.io/mechanic-prototype-soundwave-floors", "video": "", "text": "Feel sound as it reverberates through the ground you walk.\n\nhow do sounds ~feel~? I started off with a standard audio visualizer, but quickly spiraled into a deep episode of experimentation: what if the bars were platforms? What if they launched you? What if there was a distant raindrop? La Vie en Rose? A dog behind a fence! Jumpscare! There is such a far border for creativity in this one, and I’m excited to return to reimplement it with newfound expertise." },
    { "id":12, "title": "Elevator Pitch (Round 01)", "date": "February 2024", "skills": ["unity engine lead", "prototyper"], "subtitle": "Power in the palm of your hand.", "size": "small", "image": "images/Prototype__ElevatorPitch04.gif", "color": [204, 204, 204], "textColor": "white", "link": "https://cannedcorgies.itch.io/elevator-pitch-web-version", "video": "", "text": "Greyboxing for our experimental first person physics platformer. Gravity is inconsistent, and scattered throughout the testing course are orange pillars. Click and drag towards them and you’ll find your orientation flipped!\n\nWhen our team was given the one-hand accommodation requirement, the attendance went hush. How are we supposed to make a thrilling game that could be played all with one hand? But where some saw tedium, my team saw excitement. We thought “what game could be thrilling to play with only one hand?” And from a restriction came our gimmick.\n\nWe experimented various interactions that could be accomplished with one hand, from rotating objects to moving and stretching. The most innovative, however, was grappling. While ideating unique means of traversal that would empower one-handed individuals, I opted to change the direction of gravity for the player, making every grapple pivotal.\n\nTo accomplish the gravity-shifting, I constructed custom gravity distinct from Unity’s, marking my second step towards taking greater control of the software’s physics system." }, 
    { "id":13, "title": "The Ladybug and Me", "date": "February 2024", "skills": ["unity", "prototyper"], "subtitle": "We are together.", "size": "small", "image": "images/Prototype__TheLadybugAndMe.gif", "color": [95, 174, 246], "textColor": "black", "link": "https://cannedcorgies.itch.io/we-are-together-the-ladybug-and-i", "video": "", "text": "Whimsical encounters with urban wildlife! Harmonize with a curious ladybug.\n\nAs of this point, I have come far in pushing Unity to its technical limits as it competes with imagination. There is much, much left in how one harnesses the software’s capabilities to serve curiosity, but I figured I could benefit from stretching back to form. These two prototypes return to mechanical minimalism but with a new taste for emotion. (continue on next prototype)" },
    { "id":14, "title": "Early Morning Traffic", "date": "March 2024", "skills": ["unity", "prototyper"], "subtitle": "Small world.", "size": "small", "image": "images/Prototype__EarlyMorningTraffic.gif", "color": [95, 174, 246], "textColor": "black", "link": "https://cannedcorgies.itch.io/early-morning-traffic", "video": "", "text": "Clear the road for early traffic on its way to the 9-to-5!\n\nThese two prototypes also stand as a turning point in my game design philosophy, as I open myself more than ever before to inspiration from my daily life. The tickling sensation of a tiny explorer on your arm, the celestial observing of minuscule entities that can’t see you back: there are hyper-specific sensations and moments in my day-to-day which I wish everyone could relate to.\n\nGames are at this advantage where the kinesthetics of how we interact can unlock old dormant curiosity in our players. We are the keepers of nostalgia – the bearers of wonder." },
    { "id":15, "title": "Elevator Pitch (Round 03", "date": "March 2024", "skills": ["unity engine lead", "prototyper", "technical artist", "level designer", "physics programmer"], "subtitle": "Go to the light!", "size": "small", "image": "images/ElevatorPitch01.gif", "color": [122, 142, 113], "textColor": "white", "link": "https://cannedcorgies.itch.io/elevator-pitch-vertical-slice", "video": "", "text": "The continued vertical slice of our experimental puzzle platformer. Same kinesthetics-driven philosophy, same one-hand accommodation, sleek new look and fiction. Explore a liminal space where the laws of gravities seem incoherent. Only clue: reach for the light.\n\nThis round marks our pre production step-up from our greyboxing: our vertical slice. Diving into player-ready territory, we now had two major considerations to heed moving forward, being “setting” and “nuance.” For our concept to work, we needed conceptual clarity. Sure, innovative new means of play go a long ways by themselves, but atmosphere does wonders in explaining them to players. Thus, we opted for a liminal space where nothing makes sense!\n\nAs for nuance, numerous player-side tricks were done to eliminate dissonance between player and control. One might observe subtle interpolation in grappling, or the change in icon when hovering over an interactable, even a feature as discreet as dust particles falling in the default down direction. Our mindset was: serve the player, always.\n\nReplaying round 1 – and now, replaying this one – I realize that iteration is a helluva drug." },
    { "id":16, "title": "Comfortably Numb", "date": "April 2024", "skills": ["unity", "prototyper"], "subtitle": "Ground control to Major fern...", "size": "small", "image": "images/Prototype__ComfortablyNumb.gif", "color": [7, 12, 18], "textColor": "white", "link": "https://cannedcorgies.itch.io/comfortably-numb", "video": "", "text": "Grab a paper bag, hold your Dramamine near, because you’re in for a helluva ride. In Comfortably Numb, you’re stranded in space, and all you have to make it back to the shuttle is a pistol and your sheer determination\n\nMistakes are awesome. One misplaced line – one forgotten variable – and it can send your whole project into chaos. But rather than immediately trying to iron out every wrinkle you find, there is a greater joy in asking yourself how you can ride the adrenaline of unpredictability. (continued on next prototype)" },
    { "id":17, "title": "TELL THE TRUTH", "date": "April 2024", "skills": ["unity", "prototyper"], "subtitle": "Okay, three, two, one, let's jam.", "size": "small", "image": "images/Prototype__Parkour.gif", "color": [244, 184, 130], "textColor": "black", "link": "https://cannedcorgies.itch.io/inception-or-whatever", "video": "", "text": "In TELL THE TRUTH, experience the thrill of boundlessly jumping rooftop to rooftop.\n\nThese two games were born from emergent coding. Hopelessness in space, liberation on rooftops, these are products of allowing the code to “write itself” – embracing unaccounted behaviors and running with them.\n\nThe headache came in controlling these variables as they serve overarching emotional goals: how responsive should the swaying be? Should it be precise? Or should it be stressful? And how lenient should gravity be? Safety nets? Coyote time? Questions, questions, questions. Mandatory “the sky's the limit” quote. " },
    { "id":18, "title": "Lamplight", "date": "June 2024", "skills": ["unity engine lead", "prototyper", "technical artist", "level designer"], "subtitle": "Reach for the light.", "size": "large", "image": "images/Product__Lamplight03.gif", "color": [1, 0, 18], "textColor": "white", "link": "https://cannedcorgies.itch.io/lamplight", "video": "", "text": "The full release of the experimental one-handed puzzle platformer. Traverse a colorful geometric campus with an eerie liminal underground. Play with a myriad of strange physics totems. Pull back the lonely atmosphere to uncover your role in this space. Reach for the light.\n\nThe end of a journey. Lamplight marks our proud and intense dedication to adapting a disability accommodation into an experience. A terrific blend of atmosphere and tangibility, our game is a great showcase of our strives for kinesthetically-educational gameplay.\n\nOur proudest decision: our single universal verb to have a conversation with our world, in a pattern not unbeknownst to companies like Nintendo. Opting for diversity in reactions over diversity in input, our game is easily learnable, curiously inviting, physically resonant.\n\nGoing forward, I will continue pursuing thought-provoking physicalities into my games, whether it be through innovatively kinesthetic controls or readable storied textures. There will be no shortage of experimentation in my games as they serve the learning and the curiosity of the players." },
    { "id":19, "title": "Starccato", "date": "June 2024", "skills": ["javaScript", "p5.js", "constellations programmer", "UI/ UX"], "subtitle": "Symphony of stars.", "size": "small", "image": "images/Product__Staccato.gif", "color": [32, 18, 77], "textColor": "white", "link": "https://nadoodles.github.io/CMPM147FinalProject/", "video": "", "text": "A team project for an experimentally computational generative piece.\n\n It’s easy to blow your scope up when it comes to the multilayered exponential nature of generative systems. As such, our goal was to maintain concept clarity: identify a single innovative concept and build the program fully around it.\n\nWe finished with an invitingly wondrous musical instrument that really pokes at the imagination. Easy to learn, and endlessly novel!\n\n\nContributions: concept creator, connecting controls, constellation array generation, sparks behavior/ chain reaction, strings vibrating." },
    { "id":20, "title": "Every Sparkly Woman", "date": "June 2024", "skills": ["unity", "prototyper", "technical artist", "3D artist", "sound designer"], "subtitle": "From the heart.", "size": "small", "image": "images/Umbrella.gif", "color": [0, 0, 0], "textColor": "white", "link": "https://cannedcorgies.itch.io/im-every-sparkly-woman", "video": "", "text": "I’ve found. I have a thing for lonely walks through town at night. I find the city to be painted wonderfully by a quiet agreement between brief stares, low humming, prolonged shared occupancy. There have been perils, that’s a given, but the silent moments I’ve shared alongside someone I’ll never see again, those are priceless. (continued on the next prototype)" },
    { "id":21, "title": "two hearts", "date": "June 2024", "skills": ["unity", "prototyper"], "subtitle": "we will never meet.", "size": "small", "image": "images/Prototype__TwoHearts.gif", "color": [0, 0, 0], "textColor": "white", "link": "https://cannedcorgies.itch.io/two-hearts-that-will-never-meet", "video": "", "text": "These two pieces aim to capture the quiet, tender – sometime tragic – nature of coexisting. I’m Every Sparkly Woman mirrors my midnight escapades and the characters and stories I’ve found which light up my dark trip back home. Two hearts that will never meet conveys my own struggle in feeling truly intimate with companions: an invisible barrier – a wall – which exists between me and all I ever wanted.\n\nI’ve reached a point in my artistry where not only am I allowing the world into my work, but I am allowing myself into my world. The proudest moment of my journey yet: I’ve achieved vulnerability." },
    { "id":22, "title": "i'm leavin' for the weekend", "date": "August 2024", "skills": ["prototyper", "technical artist", "3D artist", "physics programmer", "sound designer"], "subtitle": "", "size": "small", "image": "images/Prototype__Garden.gif", "color": [118, 165, 175], "textColor": "black", "link": "https://cannedcorgies.itch.io/dont-forget-to-water-the-plants", "video": "", "text": "A “soft reboot” for my prototypes going forward, moving ahead with a few new design pillars wholly integral to me: “maintain kinesthetic importance”, “maintain concept simplicity”, and “never do anything the ~boring~ way.” All three come together in this highly systemic emotionally physical microgame.\n\nThe prototype began as an attempt to replicate the elegant ballad of the sea anemone. Planning for a free-floating radial organism resulted in web-like structures, driving me to doubling down on a garden setting instead. My method involved a mixture of raycasting anchors, computing joint locations with a hint of randomness, and springifying the whole shnazz by connecting joints to adjacent other ones (with a few extra magic tricks).\n\nThe expressive physics of the web motivated me to explore other methods of adding life without animation. First after came the velocity-driven squish and stretch, a key principle of animation often exempt in the game industry. Then, came the “stiff cloth” leaf: a combination of rigging and “springifying” in an algorithmic way similar to the web.\n\nCombine the three procedural animation methods with some old habits (*cough* custom gravity *cough cough* lerping) and we have my latest new fidget toy! The degree of personality accomplishable with just a little math is thrilling! And I hope to polish my methods as I move into more tactile experiences." },
    { "id":23, "title": "i am the wind", "date": "September 2024", "skills": ["prototyper", "technical artist", "3D artist", "physics programmer", "sound designer"], "subtitle": "", "size": "small", "image": "images/Prototype__Wind01.gif", "color": [0, 93, 67], "textColor": "black", "link": "https://cannedcorgies.itch.io/i-am-the-wind", "video": "", "text": "As I continue my reboot, I am exploring what I hope to include in my “brand.” A lot of weighing it, but non-negotiable: a sense of curiosity. And it’s two-fold, because if I hope to instill curiosity in my players, I have to keep curious myself. As such, in this prototype, I focused on learning diverse methods of controls.\n\nMy most recent muse – where it was previously the garden – was the wind. Feeling the breeze every morning as I greet the day on the porch, I observed a force which is almost noticeably alive: it steps, it moves, it’s curious as it picks flowers up and puts them back down: it’s the wind, the perfect actor.\n\nAt display, you see 3 main ways of control: a simple sweeping which controls an invisible wind game object, a rhythmic slide that you see in the wind chime, and a cursor which leads the movement of a garden windmill. The greater challenge was keeping an invisible character learnable and playable – an excellent lesson in pacing, breadcrumbs, and tutorials.\n\nImplementing the controls was only half the job, as they’re only as interesting as their environment. Learning the nuances among the different types of springs has been a ride, generating style guides for discernable 3D modeling takes patience, and FMOD Studio’s incredibly approachable hub of doodads is its own sort of beast. But when you have so many juicy bits all singing in cadence, the etherealness of the prototype cannot be understated.\n\nOne of the most exciting lessons I’ve picked up on recently is how game development is able to inform the developer as much as vise versa. I remain open to growth." },
    { "id":24, "title": "Happy Birthday", "date": "October 2024", "skills": ["prototyper", "technical artist", "3D artist", "UX programmer", "sound designer"], "subtitle": "Too old.", "size": "large", "image": "images/Prototype__MusicBox01.gif", "color": [217, 208, 180], "textColor": "black", "link": "https://cannedcorgies.itch.io/the-in-and-the-out", "video": "_F0HJfrjfVg?si=juwPz0DOBmsTgHpE", "text": "Current times are dizzying: I’m in that weird limbo after graduation but before my first industry job, coming back home and feeling like wet bread in my old hometown, feeling vaguely stressed about ~somethin~; too young to feel old and too old to feel young.\n\nIn my next prototype, I knew I wanted to tackle the way in which we reflect on old memories and how we contemplate the present– does our heart beat slow and methodical? Or is it fast and unkempt? Keeping with my pillar of kinesthetic importance, I brainstormed ways to tie reflection to a verb, and I thought back to my week packing as I prepared to move back home: amidst the heap of boxes, I rediscovered a Happy Bday music box gifted to me on my 20th. I found winding it up to be both exhausting and therapeutic, given the vivid flashes of memories it induced. This was my game.\n\nThe controls are simple, in fact, recycled from the previous prototype. However, everything is built around the control: the heart pulses, the character animates, time jumps through your eyes. My proudest feat was actually the music box’s cylinder, accomplished through simple rotations, triggers, and optical illusions – yet, it works exactly like a music box.\n\nIn the end, the prototype became a poignant turn of the season for me. My takeaway this time was in the ability to understand myself through means of development: fine tuning the experience to provide the precise conditions needed for my emotional reaction was a slightly-more-than-slightly uncomfortable psychological feat of engineering, but I feel a rope now uncoiled from my chest." },
    { "id":25, "title": "Major Redwick Blasts Off", "date": "September 2024", "skills": ["prototyper", "technical artist", "3D artist", "UX programmer", "UI designer", "sound designer"], "subtitle": "See you, Major Redwick.", "size": "large", "image": "images/majorRedwick.gif", "color": [6, 0, 56], "textColor": "white", "link": "https://cannedcorgies.itch.io/major-redwick-blasts-off", "video": "dIUyktL6BUM?si=v1wiKA8n6isP2PuF", "text": "I’ve reached the checkpoint. With confidence, I am now able to say: “this is me. This is my art.” Kinesthetic importance, passive player-intimate storytelling, rampant curiosity. This is fern.\n\nA very fitting prototype, too; up in the stars, I’m able to admire how hard I’ve worked these past months to build an identity for myself. The minigames are varied and cohesive, the colors pop and tug at the player. However, my proudest technical achievement this time around has got to be the music.\n\nThe music is nearly fully computer-generated. The samples for the instruments were pulled from the Web, however, their integration is fully procedural. Therein my game is a “live-coding” script inspired by Andrew Sorensen, famed musical coder; consequently, there is a left-hand function to be found, a right-hand, bass, beat, all fully reusable while doing some reconfiguring of FMOD’s own code. My code even has its own tempo-keeping functionality to ensure instruments come in on cue! And the way the instruments escalate and stack, it’s all nothing short of.. cathartic.\n\nThe ground quaking, the stars spinning, the sun rising: the prototype was made in the image of my sister’s dreams of being an astronaut, but I believe it to be a thrilling reflection of the state of my own. I’m blasting off." },
    { "id":26, "title": "Adjustment Disorder", "date": "October 2024", "skills": ["prototyper", "technical artist", "3D artist", "UX programmer", "UI designer", "sound designer"], "subtitle": "Big Cloud", "size": "large", "image": "images/Product__AdjustmentDisorder01.gif", "color": [208, 132, 1], "textColor": "black", "link": "https://cannedcorgies.itch.io/adjustment-disorder", "video": "YzpId3gpzbQ?si=7R21Ktf9QqVRr9VQ", "text": "Recently, i underwent big changes in the way of moving back to my hometown. In a way, i feel like a college dropout even though i just graduated. And in the same way, i feel as though i deserted the life i was supposed to be having.\n\nThis game wasn’t just a portfolio set piece for me: it was therapy. Themes of nostalgia and closure collide in an introspective analysis of how we store memories in the gifts we are given.\n\nMy approach to developing the core loop was to first decide on a verb or two that the player would repeat often to hone in on the sort of narrative hypnosis you’d see in a game like Edith Finch. The gestures I went with were a simple mouse push and pull, complementary, and not too long to become second-nature. Essentially, the game became a glorified gacha machine, where the currency was interaction and the reward was discovery.\n\nThere’s a dark sky up above, and i hope it rains." },
    { "id":27, "title": "Fresas Con Crema", "date": "January 2025", "skills": ["prototyper", "technical artist", "3D artist", "UX programmer", "UI designer", "sound designer"], "subtitle": "", "size": "large", "image": "images/fresas.gif", "color": [0, 131, 208], "textColor": "black", "link": "https://cannedcorgies.itch.io/fresas-con-crema-vertical-slice", "video": "-lEjP3GOxkA?si=FX-VAdZIR2_KNNd6", "text": "From this past year, I remember intimately the following three books:\n     - The House on Mango Street by Sandra Cisneros\n     - Aristotle and Dante Discover the Secrets of the Universe by Benjamin Alire Sáenz\n     - When Breath Becomes Air by Paul Kalanith\nFor a very long time, struggled with my cultural identity and the way it collided with my vocational identity. At points where I start to feel contemplative about where I want to go, I think back to the all the wonderful people it’s taken to get me to where I’m at, and this wonderful thought always starts with my family: pops heading out into the ranch, my mama hiding a kiss in my hand. I felt – and I feel – a profound responsibility to mi gente, but in many ways I understand that I have to leave to come back to serve.\n     I was asked by an old friend and mentee, “is this how life is after college, Fern?” To which I answered, “no. My life would have been this way three years ago if I never went to college.”\n\n“Fresas con crema” does not encapsulate fully the tension of operating within a family held together delicately by twine, It doesn’t yet paint the full story of my conflicting identities growing up. It doesn’t fully pay respect to the sacrifices of my hard-working mother nor my father’s distance. However, “fresas con crema” begins to tell that story, and I begin to heal." },
    { "id":28, "title": "Presentiment", "date": "May 2025", "skills": ["prototyper", "technical artist", "sound designer", "physics programmer", "level designer"], "subtitle": "stay tuned", "size": "small", "image": "images/presentiment__screenshot.png", "color": [150, 150, 150], "textColor": "black", "link": "https://cannedcorgies.itch.io/presentiment-prototype", "video": "", "text": "Coming soon..." },
    { "id":29, "title": "what do you want to do tonight?", "date": "May 2025", "skills": ["prototyper", "storyteller"], "subtitle": "stay tuned", "size": "small", "image": "images/twolilguys.jpg", "color": [150, 150, 150], "textColor": "black", "link": "https://cannedcorgies.itch.io", "video": "", "text": "Coming soon..." },
    { "id":30, "title": "business card", "date": "", "skills": ["rapid prototyper", "storyteller", "educator", "technical artist", "3D artist", "level designer", "physics programmer", "sound designer", "engine lead"], "subtitle": "fern is open for business", "size": "large", "image": "images/heart.gif", "color": [95, 174, 246], "textColor": "white", "link": "https://cannedcorgies.itch.io", "video": "", "text": "email: alcazarfjose@gmail.com\n\nphone: 209-xxx-xxxx\n\nthe hub: https://linktr.ee/falcazar \n\nlinked in: https://www.linkedin.com/in/alcazarfjose/ \n\nitch: https://cannedcorgies.itch.io/" }
]